Tekla.Structures.Dialog.UIControls.OkCancel
The OkCancel class represents a control including the Ok-Cancel button group.

Tekla.Structures.Dialog.UIControls.OkCancel.#ctor
Initializes a new instance of the OkCancel class.

Tekla.Structures.Dialog.UIControls.OkCancel.OnLoad(System.EventArgs)
Localizes the control when loaded.
Exc: The event arguments.

Tekla.Structures.Dialog.UIControls.OkCancel.OkClicked
The OkClicked event is raised when the Ok button is clicked.

Tekla.Structures.Dialog.UIControls.OkCancel.CancelClicked
The CancelClicked event is raised when the Cancel button is clicked.

Tekla.Structures.Dialog.UIControls.OkCancel.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.OkCancel.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.OkCancel.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.